src/Documents/РасходДенег/РасходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходДенег</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.Соглашения</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВРублях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс_USD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс_EUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВРублях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВEUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.Соглашения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/РасходДенег/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Взаиморасчеты.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыОстатки.Соглашение КАК Соглашение,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВРубляхОстаток, 0) КАК СуммаВРубляхОстаток,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВUSDОстаток, 0) КАК СуммаВUSDОстаток,
	               |	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаВEURОстаток, 0) КАК СуммаВEURОстаток
	               |ИЗ
	               |	РегистрНакопления.Взаиморасчеты.Остатки(&МоментВремени, Поставщик = &Поставщик) КАК ВзаиморасчетыОстатки
	               |ГДЕ
	               |	ВзаиморасчетыОстатки.СуммаВРубляхОстаток <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВзаиморасчетыОстатки.Соглашение.ДатаОплаты";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Движение = Движения.Взаиморасчеты.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Поставщик = Поставщик;
		Движение.СуммаВРублях = СуммаВРублях;
		Движение.СуммаВUSD = СуммаВРублях/Курс_USD;
		Движение.СуммаВEUR = СуммаВРублях/Курс_EUR;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		
		
		
	КонецЕсли;
	
	
		
		
	//	СуммаКСписанию = СуммаВРублях;
	//	
	//	Если СуммаКСписанию > Выборка.СуммаВРубляхОстаток Тогда
	//	// регистр Взаиморасчеты Расход
	//	

	//	
	//	КонецЦикла;
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	//
	////
	//Если ЗначениеЗаполнено(Соглашение) Тогда
	//	
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст,
	//								"Поставщик = &Поставщик",
	//								"Поставщик = &Поставщик И Соглашение = &Соглашение");
	//	
	//	Результат = Запрос.Выполнить().Выбрать();
	//	
	//	Если Результат.Следующий() Тогда
	//		
	//		бы
	//		
	//	КонецЕсли;
	//	
	//	//Проверить сумму поставок
	//Иначе
	//	
	//КонецЕсли;
	//
	//Результат = Запрос.Выполнить().Выбрать();
	//
	//
	//
	
	

КонецПроцедуры
